Revit 2027 API
ColorOptions.EditingColor Property
 The color of the current canvas theme used to render elements when editing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color EditingColor { get; set; }
Public Property EditingColor As Color
	Get
	Set
public:
property Color^ EditingColor {
	Color^ get ();
	void set (Color^ value);
}
member EditingColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace